; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;; #######
;; #+    ##
;; ##$##  ###
;; #    # *@#
;; #   #@* ##
;; ### ### #
;;   ### ###

(define (problem p001-multiban-temporal)
  (:domain sokoban)
  (:objects
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    player-01 - player
    player-02 - player
    player-03 - player
    pos-01-01 - location
    pos-01-02 - location
    pos-01-03 - location
    pos-01-04 - location
    pos-01-05 - location
    pos-01-06 - location
    pos-01-07 - location
    pos-02-01 - location
    pos-02-02 - location
    pos-02-03 - location
    pos-02-04 - location
    pos-02-05 - location
    pos-02-06 - location
    pos-02-07 - location
    pos-03-01 - location
    pos-03-02 - location
    pos-03-03 - location
    pos-03-04 - location
    pos-03-05 - location
    pos-03-06 - location
    pos-03-07 - location
    pos-04-01 - location
    pos-04-02 - location
    pos-04-03 - location
    pos-04-04 - location
    pos-04-05 - location
    pos-04-06 - location
    pos-04-07 - location
    pos-05-01 - location
    pos-05-02 - location
    pos-05-03 - location
    pos-05-04 - location
    pos-05-05 - location
    pos-05-06 - location
    pos-05-07 - location
    pos-06-01 - location
    pos-06-02 - location
    pos-06-03 - location
    pos-06-04 - location
    pos-06-05 - location
    pos-06-06 - location
    pos-06-07 - location
    pos-07-01 - location
    pos-07-02 - location
    pos-07-03 - location
    pos-07-04 - location
    pos-07-05 - location
    pos-07-06 - location
    pos-07-07 - location
    pos-08-01 - location
    pos-08-02 - location
    pos-08-03 - location
    pos-08-04 - location
    pos-08-05 - location
    pos-08-06 - location
    pos-08-07 - location
    pos-09-01 - location
    pos-09-02 - location
    pos-09-03 - location
    pos-09-04 - location
    pos-09-05 - location
    pos-09-06 - location
    pos-09-07 - location
    pos-10-01 - location
    pos-10-02 - location
    pos-10-03 - location
    pos-10-04 - location
    pos-10-05 - location
    pos-10-06 - location
    pos-10-07 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
  )
  (:init
    (IS-GOAL pos-02-02)
    (IS-GOAL pos-07-05)
    (IS-GOAL pos-08-04)
    (IS-NONGOAL pos-01-01)
    (IS-NONGOAL pos-01-02)
    (IS-NONGOAL pos-01-03)
    (IS-NONGOAL pos-01-04)
    (IS-NONGOAL pos-01-05)
    (IS-NONGOAL pos-01-06)
    (IS-NONGOAL pos-01-07)
    (IS-NONGOAL pos-02-01)
    (IS-NONGOAL pos-02-03)
    (IS-NONGOAL pos-02-04)
    (IS-NONGOAL pos-02-05)
    (IS-NONGOAL pos-02-06)
    (IS-NONGOAL pos-02-07)
    (IS-NONGOAL pos-03-01)
    (IS-NONGOAL pos-03-02)
    (IS-NONGOAL pos-03-03)
    (IS-NONGOAL pos-03-04)
    (IS-NONGOAL pos-03-05)
    (IS-NONGOAL pos-03-06)
    (IS-NONGOAL pos-03-07)
    (IS-NONGOAL pos-04-01)
    (IS-NONGOAL pos-04-02)
    (IS-NONGOAL pos-04-03)
    (IS-NONGOAL pos-04-04)
    (IS-NONGOAL pos-04-05)
    (IS-NONGOAL pos-04-06)
    (IS-NONGOAL pos-04-07)
    (IS-NONGOAL pos-05-01)
    (IS-NONGOAL pos-05-02)
    (IS-NONGOAL pos-05-03)
    (IS-NONGOAL pos-05-04)
    (IS-NONGOAL pos-05-05)
    (IS-NONGOAL pos-05-06)
    (IS-NONGOAL pos-05-07)
    (IS-NONGOAL pos-06-01)
    (IS-NONGOAL pos-06-02)
    (IS-NONGOAL pos-06-03)
    (IS-NONGOAL pos-06-04)
    (IS-NONGOAL pos-06-05)
    (IS-NONGOAL pos-06-06)
    (IS-NONGOAL pos-06-07)
    (IS-NONGOAL pos-07-01)
    (IS-NONGOAL pos-07-02)
    (IS-NONGOAL pos-07-03)
    (IS-NONGOAL pos-07-04)
    (IS-NONGOAL pos-07-06)
    (IS-NONGOAL pos-07-07)
    (IS-NONGOAL pos-08-01)
    (IS-NONGOAL pos-08-02)
    (IS-NONGOAL pos-08-03)
    (IS-NONGOAL pos-08-05)
    (IS-NONGOAL pos-08-06)
    (IS-NONGOAL pos-08-07)
    (IS-NONGOAL pos-09-01)
    (IS-NONGOAL pos-09-02)
    (IS-NONGOAL pos-09-03)
    (IS-NONGOAL pos-09-04)
    (IS-NONGOAL pos-09-05)
    (IS-NONGOAL pos-09-06)
    (IS-NONGOAL pos-09-07)
    (IS-NONGOAL pos-10-01)
    (IS-NONGOAL pos-10-02)
    (IS-NONGOAL pos-10-03)
    (IS-NONGOAL pos-10-04)
    (IS-NONGOAL pos-10-05)
    (IS-NONGOAL pos-10-06)
    (IS-NONGOAL pos-10-07)
    (MOVE-DIR pos-01-07 pos-02-07 dir-right)
    (MOVE-DIR pos-02-02 pos-03-02 dir-right)
    (MOVE-DIR pos-02-04 pos-02-05 dir-down)
    (MOVE-DIR pos-02-04 pos-03-04 dir-right)
    (MOVE-DIR pos-02-05 pos-02-04 dir-up)
    (MOVE-DIR pos-02-05 pos-03-05 dir-right)
    (MOVE-DIR pos-02-07 pos-01-07 dir-left)
    (MOVE-DIR pos-03-02 pos-02-02 dir-left)
    (MOVE-DIR pos-03-02 pos-03-03 dir-down)
    (MOVE-DIR pos-03-02 pos-04-02 dir-right)
    (MOVE-DIR pos-03-03 pos-03-02 dir-up)
    (MOVE-DIR pos-03-03 pos-03-04 dir-down)
    (MOVE-DIR pos-03-04 pos-02-04 dir-left)
    (MOVE-DIR pos-03-04 pos-03-03 dir-up)
    (MOVE-DIR pos-03-04 pos-03-05 dir-down)
    (MOVE-DIR pos-03-04 pos-04-04 dir-right)
    (MOVE-DIR pos-03-05 pos-02-05 dir-left)
    (MOVE-DIR pos-03-05 pos-03-04 dir-up)
    (MOVE-DIR pos-03-05 pos-04-05 dir-right)
    (MOVE-DIR pos-04-02 pos-03-02 dir-left)
    (MOVE-DIR pos-04-02 pos-05-02 dir-right)
    (MOVE-DIR pos-04-04 pos-03-04 dir-left)
    (MOVE-DIR pos-04-04 pos-04-05 dir-down)
    (MOVE-DIR pos-04-04 pos-05-04 dir-right)
    (MOVE-DIR pos-04-05 pos-03-05 dir-left)
    (MOVE-DIR pos-04-05 pos-04-04 dir-up)
    (MOVE-DIR pos-04-05 pos-04-06 dir-down)
    (MOVE-DIR pos-04-06 pos-04-05 dir-up)
    (MOVE-DIR pos-05-02 pos-04-02 dir-left)
    (MOVE-DIR pos-05-02 pos-06-02 dir-right)
    (MOVE-DIR pos-05-04 pos-04-04 dir-left)
    (MOVE-DIR pos-06-02 pos-05-02 dir-left)
    (MOVE-DIR pos-06-02 pos-06-03 dir-down)
    (MOVE-DIR pos-06-03 pos-06-02 dir-up)
    (MOVE-DIR pos-06-03 pos-07-03 dir-right)
    (MOVE-DIR pos-06-05 pos-07-05 dir-right)
    (MOVE-DIR pos-07-03 pos-06-03 dir-left)
    (MOVE-DIR pos-07-03 pos-07-04 dir-down)
    (MOVE-DIR pos-07-04 pos-07-03 dir-up)
    (MOVE-DIR pos-07-04 pos-07-05 dir-down)
    (MOVE-DIR pos-07-04 pos-08-04 dir-right)
    (MOVE-DIR pos-07-05 pos-06-05 dir-left)
    (MOVE-DIR pos-07-05 pos-07-04 dir-up)
    (MOVE-DIR pos-07-05 pos-08-05 dir-right)
    (MOVE-DIR pos-08-01 pos-09-01 dir-right)
    (MOVE-DIR pos-08-04 pos-07-04 dir-left)
    (MOVE-DIR pos-08-04 pos-08-05 dir-down)
    (MOVE-DIR pos-08-04 pos-09-04 dir-right)
    (MOVE-DIR pos-08-05 pos-07-05 dir-left)
    (MOVE-DIR pos-08-05 pos-08-04 dir-up)
    (MOVE-DIR pos-08-05 pos-08-06 dir-down)
    (MOVE-DIR pos-08-06 pos-08-05 dir-up)
    (MOVE-DIR pos-09-01 pos-08-01 dir-left)
    (MOVE-DIR pos-09-01 pos-09-02 dir-down)
    (MOVE-DIR pos-09-01 pos-10-01 dir-right)
    (MOVE-DIR pos-09-02 pos-09-01 dir-up)
    (MOVE-DIR pos-09-02 pos-10-02 dir-right)
    (MOVE-DIR pos-09-04 pos-08-04 dir-left)
    (MOVE-DIR pos-10-01 pos-09-01 dir-left)
    (MOVE-DIR pos-10-01 pos-10-02 dir-down)
    (MOVE-DIR pos-10-02 pos-09-02 dir-left)
    (MOVE-DIR pos-10-02 pos-10-01 dir-up)
    (MOVE-DIR pos-10-06 pos-10-07 dir-down)
    (MOVE-DIR pos-10-07 pos-10-06 dir-up)
    (at player-01 pos-02-02)
    (at player-02 pos-09-04)
    (at player-03 pos-06-05)
    (at stone-01 pos-03-03)
    (at stone-02 pos-08-04)
    (at stone-03 pos-07-05)
    (at-goal stone-02)
    (at-goal stone-03)
    (clear pos-01-07)
    (clear pos-02-04)
    (clear pos-02-05)
    (clear pos-02-07)
    (clear pos-03-02)
    (clear pos-03-04)
    (clear pos-03-05)
    (clear pos-04-02)
    (clear pos-04-04)
    (clear pos-04-05)
    (clear pos-04-06)
    (clear pos-05-02)
    (clear pos-05-04)
    (clear pos-06-02)
    (clear pos-06-03)
    (clear pos-06-07)
    (clear pos-07-03)
    (clear pos-07-04)
    (clear pos-08-01)
    (clear pos-08-05)
    (clear pos-08-06)
    (clear pos-09-01)
    (clear pos-09-02)
    (clear pos-10-01)
    (clear pos-10-02)
    (clear pos-10-06)
    (clear pos-10-07)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
  ))
  
)

; plan
1. (push-to-nongoal player-02 stone-02 pos-09-04 pos-08-04 pos-07-04 dir-left)
   deleted: (at player-02 pos-09-04) (at stone-02 pos-08-04) (clear pos-07-04) (at-goal stone-02)
   added: (at player-02 pos-08-04) (at stone-02 pos-07-04) (clear pos-09-04)
   goals met: 1 of 3
2. (move player-01 pos-02-02 pos-03-02 dir-right)
   deleted: (at player-01 pos-02-02) (clear pos-03-02)
   added: (at player-01 pos-03-02) (clear pos-02-02)
   goals met: 1 of 3
3. (move player-01 pos-03-02 pos-04-02 dir-right)
   deleted: (at player-01 pos-03-02) (clear pos-04-02)
   added: (at player-01 pos-04-02) (clear pos-03-02)
   goals met: 1 of 3
4. (move player-02 pos-08-04 pos-08-05 dir-down)
   deleted: (at player-02 pos-08-04) (clear pos-08-05)
   added: (at player-02 pos-08-05) (clear pos-08-04)
   goals met: 1 of 3
5. (move player-02 pos-08-05 pos-08-06 dir-down)
   deleted: (at player-02 pos-08-05) (clear pos-08-06)
   added: (at player-02 pos-08-06) (clear pos-08-05)
   goals met: 1 of 3
6. (move player-01 pos-04-02 pos-05-02 dir-right)
   deleted: (at player-01 pos-04-02) (clear pos-05-02)
   added: (at player-01 pos-05-02) (clear pos-04-02)
   goals met: 1 of 3
7. (move player-01 pos-05-02 pos-06-02 dir-right)
   deleted: (at player-01 pos-05-02) (clear pos-06-02)
   added: (at player-01 pos-06-02) (clear pos-05-02)
   goals met: 1 of 3
8. (move player-01 pos-06-02 pos-06-03 dir-down)
   deleted: (at player-01 pos-06-02) (clear pos-06-03)
   added: (at player-01 pos-06-03) (clear pos-06-02)
   goals met: 1 of 3
9. (move player-01 pos-06-03 pos-07-03 dir-right)
   deleted: (at player-01 pos-06-03) (clear pos-07-03)
   added: (at player-01 pos-07-03) (clear pos-06-03)
   goals met: 1 of 3
10. (push-to-nongoal player-03 stone-03 pos-06-05 pos-07-05 pos-08-05 dir-right)
   deleted: (at player-03 pos-06-05) (at stone-03 pos-07-05) (clear pos-08-05) (at-goal stone-03)
   added: (at player-03 pos-07-05) (at stone-03 pos-08-05) (clear pos-06-05)
   goals met: 0 of 3
11. (move player-03 pos-07-05 pos-06-05 dir-left)
   deleted: (at player-03 pos-07-05) (clear pos-06-05)
   added: (at player-03 pos-06-05) (clear pos-07-05)
   goals met: 0 of 3
12. (push-to-goal player-01 stone-02 pos-07-03 pos-07-04 pos-07-05 dir-down)
   deleted: (at player-01 pos-07-03) (at stone-02 pos-07-04) (clear pos-07-05)
   added: (at player-01 pos-07-04) (at stone-02 pos-07-05) (clear pos-07-03) (at-goal stone-02)
   goals met: 1 of 3
13. (move player-01 pos-07-04 pos-08-04 dir-right)
   deleted: (at player-01 pos-07-04) (clear pos-08-04)
   added: (at player-01 pos-08-04) (clear pos-07-04)
   goals met: 1 of 3
14. (move player-01 pos-08-04 pos-09-04 dir-right)
   deleted: (at player-01 pos-08-04) (clear pos-09-04)
   added: (at player-01 pos-09-04) (clear pos-08-04)
   goals met: 1 of 3
15. (push-to-goal player-02 stone-03 pos-08-06 pos-08-05 pos-08-04 dir-up)
   deleted: (at player-02 pos-08-06) (at stone-03 pos-08-05) (clear pos-08-04)
   added: (at player-02 pos-08-05) (at stone-03 pos-08-04) (clear pos-08-06) (at-goal stone-03)
   goals met: 2 of 3
16. (move player-02 pos-08-05 pos-08-06 dir-down)
   deleted: (at player-02 pos-08-05) (clear pos-08-06)
   added: (at player-02 pos-08-06) (clear pos-08-05)
   goals met: 2 of 3
17. (push-to-nongoal player-03 stone-02 pos-06-05 pos-07-05 pos-08-05 dir-right)
   deleted: (at player-03 pos-06-05) (at stone-02 pos-07-05) (clear pos-08-05) (at-goal stone-02)
   added: (at player-03 pos-07-05) (at stone-02 pos-08-05) (clear pos-06-05)
   goals met: 1 of 3
18. (move player-03 pos-07-05 pos-07-04 dir-up)
   deleted: (at player-03 pos-07-05) (clear pos-07-04)
   added: (at player-03 pos-07-04) (clear pos-07-05)
   goals met: 1 of 3
19. (move player-03 pos-07-04 pos-07-03 dir-up)
   deleted: (at player-03 pos-07-04) (clear pos-07-03)
   added: (at player-03 pos-07-03) (clear pos-07-04)
   goals met: 1 of 3
20. (push-to-nongoal player-01 stone-03 pos-09-04 pos-08-04 pos-07-04 dir-left)
   deleted: (at player-01 pos-09-04) (at stone-03 pos-08-04) (clear pos-07-04) (at-goal stone-03)
   added: (at player-01 pos-08-04) (at stone-03 pos-07-04) (clear pos-09-04)
   goals met: 0 of 3
21. (push-to-goal player-03 stone-03 pos-07-03 pos-07-04 pos-07-05 dir-down)
   deleted: (at player-03 pos-07-03) (at stone-03 pos-07-04) (clear pos-07-05)
   added: (at player-03 pos-07-04) (at stone-03 pos-07-05) (clear pos-07-03) (at-goal stone-03)
   goals met: 1 of 3
22. (move player-03 pos-07-04 pos-07-03 dir-up)
   deleted: (at player-03 pos-07-04) (clear pos-07-03)
   added: (at player-03 pos-07-03) (clear pos-07-04)
   goals met: 1 of 3
23. (move player-03 pos-07-03 pos-06-03 dir-left)
   deleted: (at player-03 pos-07-03) (clear pos-06-03)
   added: (at player-03 pos-06-03) (clear pos-07-03)
   goals met: 1 of 3
24. (move player-03 pos-06-03 pos-06-02 dir-up)
   deleted: (at player-03 pos-06-03) (clear pos-06-02)
   added: (at player-03 pos-06-02) (clear pos-06-03)
   goals met: 1 of 3
25. (move player-03 pos-06-02 pos-05-02 dir-left)
   deleted: (at player-03 pos-06-02) (clear pos-05-02)
   added: (at player-03 pos-05-02) (clear pos-06-02)
   goals met: 1 of 3
26. (move player-03 pos-05-02 pos-04-02 dir-left)
   deleted: (at player-03 pos-05-02) (clear pos-04-02)
   added: (at player-03 pos-04-02) (clear pos-05-02)
   goals met: 1 of 3
27. (move player-01 pos-08-04 pos-07-04 dir-left)
   deleted: (at player-01 pos-08-04) (clear pos-07-04)
   added: (at player-01 pos-07-04) (clear pos-08-04)
   goals met: 1 of 3
28. (push-to-goal player-02 stone-02 pos-08-06 pos-08-05 pos-08-04 dir-up)
   deleted: (at player-02 pos-08-06) (at stone-02 pos-08-05) (clear pos-08-04)
   added: (at player-02 pos-08-05) (at stone-02 pos-08-04) (clear pos-08-06) (at-goal stone-02)
   goals met: 2 of 3
29. (move player-01 pos-07-04 pos-07-03 dir-up)
   deleted: (at player-01 pos-07-04) (clear pos-07-03)
   added: (at player-01 pos-07-03) (clear pos-07-04)
   goals met: 2 of 3
30. (move player-01 pos-07-03 pos-06-03 dir-left)
   deleted: (at player-01 pos-07-03) (clear pos-06-03)
   added: (at player-01 pos-06-03) (clear pos-07-03)
   goals met: 2 of 3
31. (move player-01 pos-06-03 pos-06-02 dir-up)
   deleted: (at player-01 pos-06-03) (clear pos-06-02)
   added: (at player-01 pos-06-02) (clear pos-06-03)
   goals met: 2 of 3
32. (move player-01 pos-06-02 pos-05-02 dir-left)
   deleted: (at player-01 pos-06-02) (clear pos-05-02)
   added: (at player-01 pos-05-02) (clear pos-06-02)
   goals met: 2 of 3
33. (move player-03 pos-04-02 pos-03-02 dir-left)
   deleted: (at player-03 pos-04-02) (clear pos-03-02)
   added: (at player-03 pos-03-02) (clear pos-04-02)
   goals met: 2 of 3
34. (move player-01 pos-05-02 pos-04-02 dir-left)
   deleted: (at player-01 pos-05-02) (clear pos-04-02)
   added: (at player-01 pos-04-02) (clear pos-05-02)
   goals met: 2 of 3
35. (push-to-nongoal player-03 stone-01 pos-03-02 pos-03-03 pos-03-04 dir-down)
   deleted: (at player-03 pos-03-02) (at stone-01 pos-03-03) (clear pos-03-04)
   added: (at player-03 pos-03-03) (at stone-01 pos-03-04) (clear pos-03-02)
   goals met: 2 of 3
36. (push-to-nongoal player-03 stone-01 pos-03-03 pos-03-04 pos-03-05 dir-down)
   deleted: (at player-03 pos-03-03) (at stone-01 pos-03-04) (clear pos-03-05)
   added: (at player-03 pos-03-04) (at stone-01 pos-03-05) (clear pos-03-03)
   goals met: 2 of 3
37. (move player-03 pos-03-04 pos-04-04 dir-right)
   deleted: (at player-03 pos-03-04) (clear pos-04-04)
   added: (at player-03 pos-04-04) (clear pos-03-04)
   goals met: 2 of 3
38. (move player-03 pos-04-04 pos-04-05 dir-down)
   deleted: (at player-03 pos-04-04) (clear pos-04-05)
   added: (at player-03 pos-04-05) (clear pos-04-04)
   goals met: 2 of 3
39. (move player-03 pos-04-05 pos-04-06 dir-down)
   deleted: (at player-03 pos-04-05) (clear pos-04-06)
   added: (at player-03 pos-04-06) (clear pos-04-05)
   goals met: 2 of 3
40. (move player-01 pos-04-02 pos-03-02 dir-left)
   deleted: (at player-01 pos-04-02) (clear pos-03-02)
   added: (at player-01 pos-03-02) (clear pos-04-02)
   goals met: 2 of 3
41. (move player-01 pos-03-02 pos-03-03 dir-down)
   deleted: (at player-01 pos-03-02) (clear pos-03-03)
   added: (at player-01 pos-03-03) (clear pos-03-02)
   goals met: 2 of 3
42. (move player-01 pos-03-03 pos-03-04 dir-down)
   deleted: (at player-01 pos-03-03) (clear pos-03-04)
   added: (at player-01 pos-03-04) (clear pos-03-03)
   goals met: 2 of 3
43. (move player-01 pos-03-04 pos-02-04 dir-left)
   deleted: (at player-01 pos-03-04) (clear pos-02-04)
   added: (at player-01 pos-02-04) (clear pos-03-04)
   goals met: 2 of 3
44. (move player-01 pos-02-04 pos-02-05 dir-down)
   deleted: (at player-01 pos-02-04) (clear pos-02-05)
   added: (at player-01 pos-02-05) (clear pos-02-04)
   goals met: 2 of 3
45. (push-to-nongoal player-01 stone-01 pos-02-05 pos-03-05 pos-04-05 dir-right)
   deleted: (at player-01 pos-02-05) (at stone-01 pos-03-05) (clear pos-04-05)
   added: (at player-01 pos-03-05) (at stone-01 pos-04-05) (clear pos-02-05)
   goals met: 2 of 3
46. (move player-01 pos-03-05 pos-03-04 dir-up)
   deleted: (at player-01 pos-03-05) (clear pos-03-04)
   added: (at player-01 pos-03-04) (clear pos-03-05)
   goals met: 2 of 3
47. (move player-01 pos-03-04 pos-04-04 dir-right)
   deleted: (at player-01 pos-03-04) (clear pos-04-04)
   added: (at player-01 pos-04-04) (clear pos-03-04)
   goals met: 2 of 3
48. (move player-01 pos-04-04 pos-05-04 dir-right)
   deleted: (at player-01 pos-04-04) (clear pos-05-04)
   added: (at player-01 pos-05-04) (clear pos-04-04)
   goals met: 2 of 3
49. (push-to-nongoal player-03 stone-01 pos-04-06 pos-04-05 pos-04-04 dir-up)
   deleted: (at player-03 pos-04-06) (at stone-01 pos-04-05) (clear pos-04-04)
   added: (at player-03 pos-04-05) (at stone-01 pos-04-04) (clear pos-04-06)
   goals met: 2 of 3
50. (move player-03 pos-04-05 pos-03-05 dir-left)
   deleted: (at player-03 pos-04-05) (clear pos-03-05)
   added: (at player-03 pos-03-05) (clear pos-04-05)
   goals met: 2 of 3
51. (move player-03 pos-03-05 pos-03-04 dir-up)
   deleted: (at player-03 pos-03-05) (clear pos-03-04)
   added: (at player-03 pos-03-04) (clear pos-03-05)
   goals met: 2 of 3
52. (move player-03 pos-03-04 pos-03-03 dir-up)
   deleted: (at player-03 pos-03-04) (clear pos-03-03)
   added: (at player-03 pos-03-03) (clear pos-03-04)
   goals met: 2 of 3
53. (push-to-nongoal player-01 stone-01 pos-05-04 pos-04-04 pos-03-04 dir-left)
   deleted: (at player-01 pos-05-04) (at stone-01 pos-04-04) (clear pos-03-04)
   added: (at player-01 pos-04-04) (at stone-01 pos-03-04) (clear pos-05-04)
   goals met: 2 of 3
54. (move player-03 pos-03-03 pos-03-02 dir-up)
   deleted: (at player-03 pos-03-03) (clear pos-03-02)
   added: (at player-03 pos-03-02) (clear pos-03-03)
   goals met: 2 of 3
55. (move player-03 pos-03-02 pos-04-02 dir-right)
   deleted: (at player-03 pos-03-02) (clear pos-04-02)
   added: (at player-03 pos-04-02) (clear pos-03-02)
   goals met: 2 of 3
56. (move player-01 pos-04-04 pos-04-05 dir-down)
   deleted: (at player-01 pos-04-04) (clear pos-04-05)
   added: (at player-01 pos-04-05) (clear pos-04-04)
   goals met: 2 of 3
57. (move player-01 pos-04-05 pos-03-05 dir-left)
   deleted: (at player-01 pos-04-05) (clear pos-03-05)
   added: (at player-01 pos-03-05) (clear pos-04-05)
   goals met: 2 of 3
58. (push-to-nongoal player-01 stone-01 pos-03-05 pos-03-04 pos-03-03 dir-up)
   deleted: (at player-01 pos-03-05) (at stone-01 pos-03-04) (clear pos-03-03)
   added: (at player-01 pos-03-04) (at stone-01 pos-03-03) (clear pos-03-05)
   goals met: 2 of 3
59. (push-to-nongoal player-01 stone-01 pos-03-04 pos-03-03 pos-03-02 dir-up)
   deleted: (at player-01 pos-03-04) (at stone-01 pos-03-03) (clear pos-03-02)
   added: (at player-01 pos-03-03) (at stone-01 pos-03-02) (clear pos-03-04)
   goals met: 2 of 3
60. (push-to-goal player-03 stone-01 pos-04-02 pos-03-02 pos-02-02 dir-left)
   deleted: (at player-03 pos-04-02) (at stone-01 pos-03-02) (clear pos-02-02)
   added: (at player-03 pos-03-02) (at stone-01 pos-02-02) (clear pos-04-02) (at-goal stone-01)
   goals met: 3 of 3
